<?php


namespace app\classes;


class Blog
{
    private $blogs;

    public function __construct()
    {
        $this->blogs = [
            0=>[
                'id' => 1,
                'title' => 'ব্যক্তিগত আক্রমণ করলে সামাল দিতে পারবেন না, কাদেরকে ফখরুল',
                'description' => 'আওয়ামী লীগের সাধারণ সম্পাদক ওবায়দুল কাদেরকে উদ্দেশ করে বিএনপির মহাসচিব মির্জা ফখরুল ইসলাম আলমগীর বলেন, ব্যক্তিগত পর্যায়ে আক্রমণ করলে সামাল দিতে পারবেন না। আজ রোববার দুপুরে রাজধানীর নয়াপল্টনে বিএনপির কেন্দ্রীয় কার্যালয়ে আয়োজিত সংবাদ সম্মেলনে মির্জা ফখরুল এসব কথা বলেন। গতকাল শনিবার বিকেলে ঢাকা জেলা আওয়ামী লীগের ত্রিবার্ষিক সম্মেলনে ওবায়দুল কাদের বিএনপির মহাসচিব মির্জা ফখরুল ইসলাম আলমগীরকে উদ্দেশে করে বলেছিলেন, ‘বিএনপির মহাসচিব মির্জা ফখরুল টাকার বস্তার ওপর শুয়ে আছেন। ফখরুল এখন চাঙা হয়ে গেছেন। টাকা পাচ্ছেন তো। টাকারে টাকা! আরব আমিরাতের টাকা, দুবাইয়ের টাকা। এই তো এল টাকা। ফখরুল মহাখুশি।’',
                'image' => '111.jpg'
            ],
            1=>[
                'id'=>2,
                'title'=>'‘শেষ দিকে সাকিবের দারুণ ফিল্ডিং খেলাটা ঘুরিয়ে দিল’',
                'description'=> 'ক্রেগ আরভিনের চোখেমুখে তখন হতাশার ছাপ। খুব কাছে গিয়েও জয় হাতছাড়া। ততক্ষণে ডাগআউট থেকে বেরিয়ে সবার সঙ্গে সৌজন্য করমর্দন শেষ করে ফেলেছেন। কিন্তু আচমকাই যেন দৃশ্যপট পাল্টে গেল। আক্ষরিক অর্থেই পাল্টাল। গ্যাবার বড় স্ক্রিনে ভেসে উঠল ব্লেসিং মুজারাবানি ‘নট আউট’। স্টাম্প ভাঙার আগে নুরুল হাসান বল ধরেছেন স্টাম্পের সামনে থেকে। মুজারাবানি আউট তো হনইনি, ‘নো’ বলে বাড়তি এক রান পাওয়ার পাশাপাশি দলকে জেতানোর জন্য পান আরেকটি বল। জিম্বাবুয়ের জন্য ‘মরে যাওয়া’ ম্যাচটা জীবিত হয়ে উঠল আচমকাই। শেষ পর্যন্ত জিম্বাবুয়ে পারেনি, হেরেছে ৩ রানে। ',
                'image' => '112.jpg'
            ],
            2=>[
                'id'=>3,
                'title' => 'ভোলার মেঘনায় ধরা পড়ছে বড় বড় পাঙাশ',
                'description' => 'ভোলার মেঘনা নদীতে বড় বড় পাঙাশ মাছ ধরা পড়ছে। ইলিশ মাছ কম ধরা পড়লেও বিপুল সংখ্যায় পাঙাশ পাওয়ায় পুশিয়ে যাচ্ছে বলে জানালেন জেলেরা। ভোলা সদর উপজেলার ইলিশা ইউনিয়নের চডারমাথা মাছঘাটে গিয়ে দেখা যায়, প্রতি নৌকা দুটি–তিনটি করে পাঙাশ পাচ্ছে। এসব পাঙাশ জেলেরা দড়িকাছি দিয়ে বেঁধে নিয়ে আসছেন। একেকটি পাঙাশ ২ থেকে ১২ কেজি ওজনের। ৫৫০ টাকা কেজি দরে বিক্রি হচ্ছে এসব মাছ।',
                'image' => '113.jpg'
                ],
        ];
    }

    public function allBlogs()
    {
        return $this->blogs;
    }

    public function getBlogDetails($blogId)
    {
        foreach($this->blogs as $blog)
        {
            if($blog['id'] == $blogId)
            {
                return $blog;
            }
        }
    }

}